import { Container } from '../../styles/GlobalStyles';
import camperImg from '../../assets/image/home-page.jpg';
import camperImgThree from '../../assets/image/home-page-3.jpg';
import {
  Benefits,
  BenefitsImageWrapper,
  Description,
  Picture,
  SectionWrapper,
  SectionWrapperTwo,
  Title,
} from './Home.styled';

const Home = () => {
  return (
    <Container>
      <Title>Ласкаво просимо на нашу платформу бронювання кемперів!</Title>
      <Description>
        Ви готові до наступної пригоди? Годі шукати! Наша платформа бронювання
        пропонує бездоганний досвід пошуку та бронювання ідеального кемперу для
        вашої подорожі. Незалежно від того, чи плануєте ви у вихідні відпочинок,
        подорож по пересіченій місцевості або експедиція на природі - у нас є
        все, що вам потрібно.
      </Description>
      <BenefitsImageWrapper>
        <SectionWrapper>
          <section>
            <Benefits>Ознайомтеся з широким асортиментом кемперів</Benefits>
            <Description>
              Відкрийте для себе різноманітний вибір кемперів, розроблених для
              кожної потреби мандрівника. Від затишних фургонів для
              індивідуальних авантюристів до просторих автобудинків для
              сімейного відпочинку. У нас є щось для кожного. Перегляньте наш
              каталог кемперів, кожен з яких оснащений необхідними зручностями
              та готовий забезпечити вам незабутню подорож.
            </Description>
            <Benefits>Простий процес бронювання</Benefits>
            <Description>
              Забронювати кемпер вашої мрії швидко й легко за допомогою нашої
              зручної платформи. Просто знайдіть потрібне місце, виберіть дати
              подорожі та знайдіть доступні кемпери, які відповідають вашим
              критеріям. Завдяки прозорим ціноутворенням, детальним описам і
              високоякісним зображенням ви можете приймати зважені рішення та
              впевнено бронювати.
            </Description>
          </section>
          <Picture src={camperImg} alt="camper" />
        </SectionWrapper>
        <SectionWrapperTwo>
          <section>
            <Benefits>Відчуйте свободу та гнучкість</Benefits>
            <Description>
              Взявши напрокат кемпер, ви можете вільно подорожувати у своєму
              власному темпі та досліджувати бездоріжжя. Попрощайтеся з
              жорсткими маршрутами та привіт спонтанності! Відчуйте радість
              прокидатися з захоплюючими краєвидами, готувати їжу просто неба та
              створювати приємні спогади з близькими людьми.
            </Description>
            <Benefits>Бронюйте з упевненістю</Benefits>
            <Description>
              Будьте впевнені, знаючи, що ваш кемпер у надійних руках. Наша
              платформа надає перевагу задоволенню клієнтів, надійності та
              зручності. Незалежно від того, чи ви досвідчений кемпер, чи
              новачок у світі подорожей на природі, наша команда тут, щоб
              підтримати вас на кожному кроці.
            </Description>
            <Benefits>Почніть свою пригоду сьогодні!</Benefits>
            <Description>
              Чи готові ви вирушити у свою наступну пригоду? Почніть планувати
              свою подорож разом з нами та відкрийте безмежні можливості на
              відкритій дорозі. Забронюйте кемпер сьогодні та готуйтеся відчути
              повну свободу подорожей.
            </Description>
          </section>
          <Picture src={camperImgThree} alt="camper" />
        </SectionWrapperTwo>
      </BenefitsImageWrapper>
    </Container>
  );
};

export default Home;
